stm32mpu-oem/STM32DDRFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Source/Templates/iar/startup_stm32mp2xx_m33_ns.s
;********************************************************************************
;* File Name          : startup_stm32mp257xx.s
;* Author             : MCD Application Team
;* Description        : STM32MP257xx
;*                      This module performs:
;*                      - Set the initial SP
;*                      - Set the initial PC == _iar_program_start,
;*                      - Set the vector table entries with the exceptions ISR
;*                        address.
;*                      - Branches to main in the C library (which eventually
;*                        calls main()).
;*                      After Reset the Cortex-M33 processor is in Thread mode,
;*                      priority is Privileged, and the Stack is set to Main.
;*******************************************************************************
;* @attention
;*
;* Copyright (c) 2021 STMicroelectronics.
;* All rights reserved.
;*
;* This software is licensed under terms that can be found in the LICENSE file
;* in the root directory of this software component.
;* If no LICENSE file comes with this software, it is provided AS-IS.
;*
;*******************************************************************************
;
;
; The modules in this file are included in the libraries, and may be replaced
; by any user-defined modules that define the PUBLIC symbol _program_start or
; a user defined start symbol.
; To override the cstartup defined in the library, simply add your modified
; version to the workbench project.
;
; The vector table is normally located at address 0.
; When debugging in RAM, it can be located in RAM, aligned to at least 2^6.
; The name "__vector_table" has special meaning for C-SPY:
; it is where the SP start value is found, and the NVIC vector
; table register (VTOR) is initialized to this address if != 0.
;
; Cortex-M version
;

        MODULE  ?cstartup

        ;; Forward declaration of sections.
        SECTION CSTACK:DATA:NOROOT(3)

        SECTION .intvec:CODE:NOROOT(2)

        EXTERN  __iar_program_start
        EXTERN  SystemInit
        PUBLIC  __vector_table
        PUBLIC  __Vectors
        PUBLIC  __Vectors_End
        PUBLIC  __Vectors_Size

        DATA
__vector_table
        DCD     sfe(CSTACK)
        DCD     Reset_Handler                    ; Reset Handler

        DCD     NMI_Handler                      ; NMI Handler
        DCD     HardFault_Handler                ; Hard Fault Handler
        DCD     MemManage_Handler                ; MPU Fault Handler
        DCD     BusFault_Handler                 ; Bus Fault Handler
        DCD     UsageFault_Handler               ; Usage Fault Handler
        DCD     SecureFault_Handler              ; Secure Fault Handler
        DCD     0                                ; Reserved
        DCD     0                                ; Reserved
        DCD     0                                ; Reserved
        DCD     SVC_Handler                      ; SVCall Handler
        DCD     DebugMon_Handler                 ; Debug Monitor Handler
        DCD     0                                ; Reserved
        DCD     PendSV_Handler                   ; PendSV Handler
        DCD     SysTick_Handler                  ; SysTick Handler

        ; External Interrupts
        ; **********************************************************************
        ; External interrupts according to
        ; "Table 226. interrupt mapping for Cortex®-M33"
        ; in chapitre 32 "interrupt list" of reference document
        ; RM0457 - Reference Manual - STM32MP25xx - advanced ARM-based 32/64-bit MPUs
        ; file "DM00485804 (RM0457) Rev0.1.pdf" (Revision 0.1 / 09-Mar-2021)
        ;***********************************************************************
        DCD     PVD_IRQHandler                   ; PVD detector through EXTI
        DCD     PVM_IRQHandler                   ; PVM detector through EXTI
        DCD     IWDG3_IRQHandler                 ; Independent Watchdog 3 Early wake interrupt
        DCD     IWDG4_IRQHandler                 ; Independent Watchdog 4 Early wake interrupt
        DCD     IWDG1_RST_IRQHandler             ; Independent Watchdog 1 Reset through EXTI
        DCD     IWDG2_RST_IRQHandler             ; Independent Watchdog 2 Reset through EXTI
        DCD     IWDG4_RST_IRQHandler             ; Independent Watchdog 4 Reset through EXTI
        DCD     IWDG5_RST_IRQHandler             ; Independent Watchdog 5 Reset through EXTI
        DCD     WWDG1_IRQHandler                 ; Window Watchdog 1 Early Wakeup interrupt
        DCD     0
        DCD     0
        DCD     WWDG2_RST_IRQHandler             ; Window Watchdog 2 Reset through EXTI
        DCD     TAMP_IRQHandler                  ; Tamper interrupt (include LSECSS interrupts)
        DCD     RTC_IRQHandler                   ; RTC global interrupt
        DCD     TAMP_S_IRQHandler                ; Tamper secure interrupt (include LSECSS interrupts)
        DCD     RTC_S_IRQHandler                 ; RTC global secure interrupt
        DCD     RCC_IRQHandler                   ; RCC global interrupt
        DCD     EXTI2_0_IRQHandler               ; EXTI2 Line 0 interrupt
        DCD     EXTI2_1_IRQHandler               ; EXTI2 Line 1 interrupt
        DCD     EXTI2_2_IRQHandler               ; EXTI2 Line 2 interrupt
        DCD     EXTI2_3_IRQHandler               ; EXTI2 Line 3 interrupt
        DCD     EXTI2_4_IRQHandler               ; EXTI2 Line 4 interrupt
        DCD     EXTI2_5_IRQHandler               ; EXTI2 Line 5 interrupt
        DCD     EXTI2_6_IRQHandler               ; EXTI2 Line 6 interrupt
        DCD     EXTI2_7_IRQHandler               ; EXTI2 Line 7 interrupt
        DCD     EXTI2_8_IRQHandler               ; EXTI2 Line 8 interrupt
        DCD     EXTI2_9_IRQHandler               ; EXTI2 Line 9 interrupt
        DCD     EXTI2_10_IRQHandler              ; EXTI2 Line 10 interrupt
        DCD     EXTI2_11_IRQHandler              ; EXTI2 Line 11 interrupt
        DCD     EXTI2_12_IRQHandler              ; EXTI2 Line 12 interrupt
        DCD     EXTI2_13_IRQHandler              ; EXTI2 Line 13 interrupt
        DCD     EXTI2_14_IRQHandler              ; EXTI2 Line 14 interrupt
        DCD     EXTI2_15_IRQHandler              ; EXTI2 Line 15 interrupt
        DCD     HPDMA1_Channel0_IRQHandler       ; HPDMA1 Channel0 interrupt
        DCD     HPDMA1_Channel1_IRQHandler       ; HPDMA1 Channel1 interrupt
        DCD     HPDMA1_Channel2_IRQHandler       ; HPDMA1 Channel2 interrupt
        DCD     HPDMA1_Channel3_IRQHandler       ; HPDMA1 Channel3 interrupt
        DCD     HPDMA1_Channel4_IRQHandler       ; HPDMA1 Channel4 interrupt
        DCD     HPDMA1_Channel5_IRQHandler       ; HPDMA1 Channel5 interrupt
        DCD     HPDMA1_Channel6_IRQHandler       ; HPDMA1 Channel6 interrupt
        DCD     HPDMA1_Channel7_IRQHandler       ; HPDMA1 Channel7 interrupt
        DCD     HPDMA1_Channel8_IRQHandler       ; HPDMA1 Channel8 interrupt
        DCD     HPDMA1_Channel9_IRQHandler       ; HPDMA1 Channel9 interrupt
        DCD     HPDMA1_Channel10_IRQHandler      ; HPDMA1 Channel10 interrupt
        DCD     HPDMA1_Channel11_IRQHandler      ; HPDMA1 Channel11 interrupt
        DCD     HPDMA1_Channel12_IRQHandler      ; HPDMA1 Channel12 interrupt
        DCD     HPDMA1_Channel13_IRQHandler      ; HPDMA1 Channel13 interrupt
        DCD     HPDMA1_Channel14_IRQHandler      ; HPDMA1 Channel14 interrupt
        DCD     HPDMA1_Channel15_IRQHandler      ; HPDMA1 Channel15 interrupt
        DCD     HPDMA2_Channel0_IRQHandler       ; HPDMA2 Channel0 interrupt
        DCD     HPDMA2_Channel1_IRQHandler       ; HPDMA2 Channel1 interrupt
        DCD     HPDMA2_Channel2_IRQHandler       ; HPDMA2 Channel2 interrupt
        DCD     HPDMA2_Channel3_IRQHandler       ; HPDMA2 Channel3 interrupt
        DCD     HPDMA2_Channel4_IRQHandler       ; HPDMA2 Channel4 interrupt
        DCD     HPDMA2_Channel5_IRQHandler       ; HPDMA2 Channel5 interrupt
        DCD     HPDMA2_Channel6_IRQHandler       ; HPDMA2 Channel6 interrupt
        DCD     HPDMA2_Channel7_IRQHandler       ; HPDMA2 Channel7 interrupt
        DCD     HPDMA2_Channel8_IRQHandler       ; HPDMA2 Channel8 interrupt
        DCD     HPDMA2_Channel9_IRQHandler       ; HPDMA2 Channel9 interrupt
        DCD     HPDMA2_Channel10_IRQHandler      ; HPDMA2 Channel10 interrupt
        DCD     HPDMA2_Channel11_IRQHandler      ; HPDMA2 Channel11 interrupt
        DCD     HPDMA2_Channel12_IRQHandler      ; HPDMA2 Channel12 interrupt
        DCD     HPDMA2_Channel13_IRQHandler      ; HPDMA2 Channel13 interrupt
        DCD     HPDMA2_Channel14_IRQHandler      ; HPDMA2 Channel14 interrupt
        DCD     HPDMA2_Channel15_IRQHandler      ; HPDMA2 Channel15 interrupt
        DCD     HPDMA3_Channel0_IRQHandler       ; HPDMA3 Channel0 interrupt
        DCD     HPDMA3_Channel1_IRQHandler       ; HPDMA3 Channel1 interrupt
        DCD     HPDMA3_Channel2_IRQHandler       ; HPDMA3 Channel2 interrupt
        DCD     HPDMA3_Channel3_IRQHandler       ; HPDMA3 Channel3 interrupt
        DCD     HPDMA3_Channel4_IRQHandler       ; HPDMA3 Channel4 interrupt
        DCD     HPDMA3_Channel5_IRQHandler       ; HPDMA3 Channel5 interrupt
        DCD     HPDMA3_Channel6_IRQHandler       ; HPDMA3 Channel6 interrupt
        DCD     HPDMA3_Channel7_IRQHandler       ; HPDMA3 Channel7 interrupt
        DCD     HPDMA3_Channel8_IRQHandler       ; HPDMA3 Channel8 interrupt
        DCD     HPDMA3_Channel9_IRQHandler       ; HPDMA3 Channel9 interrupt
        DCD     HPDMA3_Channel10_IRQHandler      ; HPDMA3 Channel10 interrupt
        DCD     HPDMA3_Channel11_IRQHandler      ; HPDMA3 Channel11 interrupt
        DCD     HPDMA3_Channel12_IRQHandler      ; HPDMA3 Channel12 interrupt
        DCD     HPDMA3_Channel13_IRQHandler      ; HPDMA3 Channel13 interrupt
        DCD     HPDMA3_Channel14_IRQHandler      ; HPDMA3 Channel14 interrupt
        DCD     HPDMA3_Channel15_IRQHandler      ; HPDMA3 Channel15 interrupt
        DCD     LPDMA_Channel0_IRQHandler        ; LPDMA Channel0 interrupt
        DCD     LPDMA_Channel1_IRQHandler        ; LPDMA Channel1 interrupt
        DCD     LPDMA_Channel2_IRQHandler        ; LPDMA Channel2 interrupt
        DCD     LPDMA_Channel3_IRQHandler        ; LPDMA Channel3 interrupt
        DCD     ICACHE_IRQHandler                ; ICACHE interrupt
        DCD     DCACHE_IRQHandler                ; DCACHE interrupt
        DCD     ADC1_IRQHandler                  ; ADC1 interrupt
        DCD     ADC2_IRQHandler                  ; ADC2  interrupt
        DCD     ADC3_IRQHandler                  ; ADC3 interrupt
        DCD     FDCAN_CAL_IRQHandler             ; FDCAN CCU interrupt
        DCD     FDCAN1_IT0_IRQHandler            ; FDCAN1 interrupt 0
        DCD     FDCAN2_IT0_IRQHandler            ; FDCAN2 interrupt 0
        DCD     FDCAN3_IT0_IRQHandler            ; FDCAN3 interrupt 0
        DCD     FDCAN1_IT1_IRQHandler            ; FDCAN1 interrupt 1
        DCD     FDCAN2_IT1_IRQHandler            ; FDCAN2 interrupt 1
        DCD     FDCAN3_IT1_IRQHandler            ; FDCAN3 interrupt 1
        DCD     TIM1_BRK_IRQHandler              ; TIM1 Break interrupt
        DCD     TIM1_UP_IRQHandler               ; TIM1 Update interrupt
        DCD     TIM1_TRG_COM_IRQHandler          ; TIM1 Trigger and Commutation interrupts
        DCD     TIM1_CC_IRQHandler               ; TIM1 Capture Compare interrupt
        DCD     TIM20_BRK_IRQHandler             ; TIM20 Break interrupt
        DCD     TIM20_UP_IRQHandler              ; TIM20 Update interrupt
        DCD     TIM20_TRG_COM_IRQHandler         ; TIM20 Trigger and Commutation interrupts
        DCD     TIM20_CC_IRQHandler              ; TIM20 Capture Compare interrupt
        DCD     TIM2_IRQHandler                  ; TIM2 global interrupt
        DCD     TIM3_IRQHandler                  ; TIM3 global interrupt
        DCD     TIM4_IRQHandler                  ; TIM4 global interrupt
        DCD     I2C1_IRQHandler                  ; I2C1 global interrupt
        DCD     I3C1_IRQHandler                  ; I3C1 global interrupt
        DCD     I2C2_IRQHandler                  ; I2C2 global interrupt
        DCD     I3C2_IRQHandler                  ; I3C2 global interrupt
        DCD     SPI1_IRQHandler                  ; SPI1 global interrupt
        DCD     SPI2_IRQHandler                  ; SPI2 global interrupt
        DCD     USART1_IRQHandler                ; USART1 global interrupt
        DCD     USART2_IRQHandler                ; USART2 global interrupt
        DCD     USART3_IRQHandler                ; USART3 global interrupt
        DCD     VDEC_IRQHandler                  ; VDEC global interrupt
        DCD     TIM8_BRK_IRQHandler              ; TIM8 Break interrupt
        DCD     TIM8_UP_IRQHandler               ; TIM8 Update interrupt
        DCD     TIM8_TRG_COM_IRQHandler          ; TIM8 Trigger & Commutation interrupt
        DCD     TIM8_CC_IRQHandler               ; TIM8 Capture Compare interrupt
        DCD     FMC_IRQHandler                   ; FMC global interrupt
        DCD     SDMMC1_IRQHandler                ; SDMMC1 global interrupt
        DCD     TIM5_IRQHandler                  ; TIM5 global interrupt
        DCD     SPI3_IRQHandler                  ; SPI3 global interrupt
        DCD     UART4_IRQHandler                 ; UART4 global interrupt
        DCD     UART5_IRQHandler                 ; UART5 global interrupt
        DCD     TIM6_IRQHandler                  ; TIM6 global interrupt
        DCD     TIM7_IRQHandler                  ; TIM7 global interrupt
        DCD     ETH1_SBD_IRQHandler              ; ETH1 global interrupt
        DCD     ETH1_PMT_IRQHandler              ; ETH1 wake-up interrupt
        DCD     ETH1_LPI_IRQHandler              ; ETH1 LPI interrupt
        DCD     ETH2_SBD_IRQHandler              ; ETH2 global interrupt
        DCD     ETH2_PMT_IRQHandler              ; ETH2 wake-up interrupt
        DCD     ETH2_LPI_IRQHandler              ; ETH2 LPI interrupt
        DCD     USART6_IRQHandler                ; USART6 global interrupt
        DCD     I2C3_IRQHandler                  ; I2C3 global interrupt
        DCD     I3C3_IRQHandler                  ; I3C3 global interrupt
        DCD     USBH_EHCI_IRQHandler             ; USB Host EHCI interrupt
        DCD     USBH_OHCI_IRQHandler             ; USB Host OHCI interrupt
        DCD     DCMI_PSSI_IRQHandler             ; DCMI & PSSI global interrupt
        DCD     CSI_IRQHandler                   ; CSI-2 interrupt
        DCD     DSI_IRQHandler                   ; DSI Host controller global interrupt
        DCD     CRYP1_IRQHandler                 ; Crypto1 interrupt
        DCD     HASH_IRQHandler                  ; Hash interrupt
        DCD     PKA_IRQHandler                   ; PKA interrupt
        DCD     FPU_IRQHandler                   ; FPU global interrupt
        DCD     UART7_IRQHandler                 ; UART7 global interrupt
        DCD     UART8_IRQHandler                 ; UART8 global interrupt
        DCD     UART9_IRQHandler                 ; UART9 global interrupt
        DCD     LPUART1_IRQHandler               ; LPUART1 global interrupt
        DCD     SPI4_IRQHandler                  ; SPI4 global interrupt
        DCD     SPI5_IRQHandler                  ; SPI5 global interrupt
        DCD     SPI6_IRQHandler                  ; SPI6 global interrupt
        DCD     SPI7_IRQHandler                  ; SPI7 global interrupt
        DCD     SPI8_IRQHandler                  ; SPI8 global interrupt
        DCD     SAI1_IRQHandler                  ; SAI1 global interrupt
        DCD     LTDC_IRQHandler                  ; LTDC global interrupt
        DCD     LTDC_ER_IRQHandler               ; LTDC global error interrupt
        DCD     LTDC_SEC_IRQHandler              ; LTDC security global interrupt
        DCD     LTDC_SEC_ER_IRQHandler           ; LTDC security global error interrupt
        DCD     SAI2_IRQHandler                  ; SAI2 global interrupt
        DCD     OCTOSPI1_IRQHandler              ; OCTOSPI1 global interrupt
        DCD     OCTOSPI2_IRQHandler              ; OCTOSPI2 global interrupt
        DCD     OTFDEC1_IRQHandler               ; OTFDEC1 interrupt
        DCD     LPTIM1_IRQHandler                ; LPTIMER1 global interrupt
        DCD     VENC_IRQHandler                  ; VENC global interrupt
        DCD     I2C4_IRQHandler                  ; I2C4 global interrupt
        DCD     USBH_WAKEUP_IRQHandler           ; USB Host remote wake up from USB2PHY1 interrupt
        DCD     SPDIFRX_IRQHandler               ; SPDIFRX global interrupt
        DCD     IPCC1_RX_IRQHandler              ; Mailbox 1 RX Occupied interrupt
        DCD     IPCC1_TX_IRQHandler              ; Mailbox 1 TX Free interrupt
        DCD     IPCC1_RX_S_IRQHandler            ; Mailbox 1 RX Occupied secure interrupt
        DCD     IPCC1_TX_S_IRQHandler            ; Mailbox 1 TX Free secure interrupt
        DCD     IPCC2_RX_IRQHandler              ; Mailbox 2 RX Occupied interrupt
        DCD     IPCC2_TX_IRQHandler              ; Mailbox 2 TX Free interrupt
        DCD     IPCC2_RX_S_IRQHandler            ; Mailbox 2 RX Occupied secure interrupt
        DCD     IPCC2_TX_S_IRQHandler            ; Mailbox 2 TX Free secure interrupt
        DCD     SAES_IRQHandler                  ; Secure AES
        DCD     CRYP2_IRQHandler                 ; Crypto2 interrupt
        DCD     I2C5_IRQHandler                  ; I2C5 global interrupt
        DCD     USB3DR_WAKEUP_IRQHandler         ; USB3 remote wake up from USB2PHY1 interrupt
        DCD     GPU_IRQHandler                   ; GPU global Interrupt
        DCD     MDF1_FLT0_IRQHandler             ; MDF1 Filter0 interrupt
        DCD     MDF1_FLT1_IRQHandler             ; MDF1 Filter1 interrupt
        DCD     MDF1_FLT2_IRQHandler             ; MDF1 Filter2 interrupt
        DCD     MDF1_FLT3_IRQHandler             ; MDF1 Filter3 interrupt
        DCD     MDF1_FLT4_IRQHandler             ; MDF1 Filter4 interrupt
        DCD     MDF1_FLT5_IRQHandler             ; MDF1 Filter5 interrupt
        DCD     MDF1_FLT6_IRQHandler             ; MDF1 Filter6 interrupt
        DCD     MDF1_FLT7_IRQHandler             ; MDF1 Filter7 interrupt
        DCD     SAI3_IRQHandler                  ; SAI3 global interrupt
        DCD     TIM15_IRQHandler                 ; TIM15 global interrupt
        DCD     TIM16_IRQHandler                 ; TIM16 global interrupt
        DCD     TIM17_IRQHandler                 ; TIM17 global interrupt
        DCD     TIM12_IRQHandler                 ; TIM12 global interrupt
        DCD     SDMMC2_IRQHandler                ; SDMMC2 global interrupt
        DCD     DCMIPP_IRQHandler                ; DCMIPP global interrupt
        DCD     HSEM_IRQHandler                  ; HSEM nonsecure interrupt
        DCD     HSEM_S_IRQHandler                ; HSEM secure interrupt
        DCD     nCTIIRQ1_IRQHandler              ; Cortex-M33 CTI interrupt 1
        DCD     nCTIIRQ2_IRQHandler              ; Cortex-M33 CTI interrupt 2
        DCD     TIM13_IRQHandler                 ; TIM13 global interrupt
        DCD     TIM14_IRQHandler                 ; TIM14 global interrupt
        DCD     TIM10_IRQHandler                 ; TIM10 global interrupt
        DCD     RNG_IRQHandler                   ; RNG global interrupt
        DCD     ADF1_FLT_IRQHandler              ; ADF1 Filter interrupt
        DCD     I2C6_IRQHandler                  ; I2C6 global interrupt
        DCD     COMBOPHY_WAKEUP_IRQHandler       ; COMBOPHY LFPS start request interrupt
        DCD     I2C7_IRQHandler                  ; I2C7 global interrupt
        DCD     0
        DCD     I2C8_IRQHandler                  ; I2C8 global interrupt
        DCD     I3C4_IRQHandler                  ; I3C4 global interrupt
        DCD     SDMMC3_IRQHandler                ; SDMMC3 global interrupt
        DCD     LPTIM2_IRQHandler                ; LPTIMER2 global interrupt
        DCD     LPTIM3_IRQHandler                ; LPTIMER3 global interrupt
        DCD     LPTIM4_IRQHandler                ; LPTIMER4 global interrupt
        DCD     LPTIM5_IRQHandler                ; LPTIMER5 global interrupt
        DCD     OTFDEC2_IRQHandler               ; OTFDEC2 interrupt
        DCD     CPU1_SEV_IRQHandler              ; Cortex-A35 Send Event through EXTI
        DCD     CPU3_SEV_IRQHandler              ; Cortex-M0+ Send Event through EXTI
        DCD     RCC_WAKEUP_IRQHandler            ; RCC CPU2 Wake up interrupt
        DCD     SAI4_IRQHandler                  ; SAI4 global interrupt
        DCD     DTS_IRQHandler                   ; Temperature sensor interrupt
        DCD     TIM11_IRQHandler                 ; TIMER11 global interrupt
        DCD     CPU2_WAKEUP_PIN_IRQHandler       ; Interrupt for all 6 wake-up enabled by CPU2
        DCD     USB3DR_BC_IRQHandler             ; USB3 BC interrupt
        DCD     USB3DR_IRQHandler                ; USB3 interrupt
        DCD     UCPD1_IRQHandler                 ; USB PD interrupt
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     SERF_IRQHandler                  ; SERF global interrupt
        DCD     BUSPERFM_IRQHandler              ; BUS Performance Monitor interrupt
        DCD     RAMCFG_IRQHandler                ; RAM configuration global interrupt
        DCD     DDRCTRL_IRQHandler               ; DDRCTRL interrupt
        DCD     DDRPHYC_IRQHandler               ; DDRPHY interrupt (active low)
        DCD     DFI_ERR_IRQHandler               ; DDRPHY DFI error interrupt
        DCD     IAC_IRQHandler                   ; RIF Illegal access Controller interrupt
        DCD     VDDCPU_VD_IRQHandler             ; VDDCPU voltage detector interrupt
        DCD     VDDCORE_VD_IRQHandler            ; VDDCORE voltage detector interrupt
        DCD     0
        DCD     ETHSW_IRQHandler                 ; Ethernet Switch global interrupt
        DCD     ETHSW_MSGBUF_IRQHandler          ; Ethernet ACM Message buffer interrupt
        DCD     ETHSW_FSC_IRQHandler             ; Ethernet ACM Scheduler interrupt
        DCD     HPDMA1_WKUP_IRQHandler           ; HPDMA1 channel 0 to 15 wake up
        DCD     HPDMA2_WKUP_IRQHandler           ; HPDMA2 channel 0 to 15 wake up
        DCD     HPDMA3_WKUP_IRQHandler           ; HPDMA3 channel 0 to 15 wake up
        DCD     LPDMA_WKUP_IRQHandler            ; LPDMA channel 0 to 3 wake up
        DCD     UCPD1_VBUS_IRQHandler             ; USB TypeC VBUS valid interrupt
        DCD     UCPD1_VSAFE5V_IRQHandler          ; USB TypeC VSAFE5V valid interrupt
        DCD     RCC_HSI_FMON_IRQHandler          ; HSI Frequency Monitor interrupt
        DCD     VDDGPU_VD_IRQHandler             ; VDDGPU voltage detector interrupt
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     EXTI1_0_IRQHandler               ; EXTI1 Line 0 interrupt
        DCD     EXTI1_1_IRQHandler               ; EXTI1 Line 1 interrupt
        DCD     EXTI1_2_IRQHandler               ; EXTI1 Line 2 interrupt
        DCD     EXTI1_3_IRQHandler               ; EXTI1 Line 3 interrupt
        DCD     EXTI1_4_IRQHandler               ; EXTI1 Line 4 interrupt
        DCD     EXTI1_5_IRQHandler               ; EXTI1 Line 5 interrupt
