stm32mpu-oem/STM32DDRFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Source/Templates/iar/startup_stm32mp2xx_m33_ns.s
        DCD     EXTI1_6_IRQHandler               ; EXTI1 Line 6 interrupt
        DCD     EXTI1_7_IRQHandler               ; EXTI1 Line 7 interrupt
        DCD     EXTI1_8_IRQHandler               ; EXTI1 Line 8 interrupt
        DCD     EXTI1_9_IRQHandler               ; EXTI1 Line 9 interrupt
        DCD     EXTI1_10_IRQHandler              ; EXTI1 Line 10 interrupt
        DCD     EXTI1_11_IRQHandler              ; EXTI1 Line 11 interrupt
        DCD     EXTI1_12_IRQHandler              ; EXTI1 Line 12 interrupt
        DCD     EXTI1_13_IRQHandler              ; EXTI1 Line 13 interrupt
        DCD     EXTI1_14_IRQHandler              ; EXTI1 Line 14 interrupt
        DCD     EXTI1_15_IRQHandler              ; EXTI1 Line 15 interrupt
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     IS2M_IRQHandler                  ; IS2M fault detection interrupt
        DCD     0
        DCD     DDRPERFM_IRQHandler              ; DDR Performance Monitor interrupt
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0
        DCD     0

__Vectors_End

__Vectors       EQU   __vector_table
__Vectors_Size  EQU   __Vectors_End - __Vectors

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; Default interrupt handlers.
;;
        THUMB
        PUBWEAK Reset_Handler
        SECTION .text:CODE:NOROOT:REORDER(2)
Reset_Handler
        LDR     R0, =SystemInit
        BLX     R0
        LDR     R0, =__iar_program_start
        BX      R0

        PUBWEAK NMI_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
NMI_Handler
        B NMI_Handler

        PUBWEAK HardFault_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
HardFault_Handler
        B HardFault_Handler

        PUBWEAK MemManage_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
MemManage_Handler
        B MemManage_Handler

        PUBWEAK BusFault_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
BusFault_Handler
        B BusFault_Handler

        PUBWEAK UsageFault_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
UsageFault_Handler
        B UsageFault_Handler

        PUBWEAK SecureFault_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
SecureFault_Handler
        B SecureFault_Handler

        PUBWEAK SVC_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
SVC_Handler
        B SVC_Handler

        PUBWEAK DebugMon_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
DebugMon_Handler
        B DebugMon_Handler

        PUBWEAK PendSV_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
PendSV_Handler
        B PendSV_Handler

        PUBWEAK SysTick_Handler
        SECTION .text:CODE:NOROOT:REORDER(1)
SysTick_Handler
        B SysTick_Handler

        PUBWEAK PVD_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
PVD_IRQHandler
        B PVD_IRQHandler

        PUBWEAK PVM_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
PVM_IRQHandler
        B PVM_IRQHandler

        PUBWEAK IWDG3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
IWDG3_IRQHandler
        B IWDG3_IRQHandler

        PUBWEAK IWDG4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
IWDG4_IRQHandler
        B IWDG4_IRQHandler

        PUBWEAK IWDG1_RST_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
IWDG1_RST_IRQHandler
        B IWDG1_RST_IRQHandler

        PUBWEAK IWDG2_RST_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
IWDG2_RST_IRQHandler
        B IWDG2_RST_IRQHandler

        PUBWEAK IWDG4_RST_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
IWDG4_RST_IRQHandler
        B IWDG4_RST_IRQHandler

        PUBWEAK IWDG5_RST_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
IWDG5_RST_IRQHandler
        B IWDG5_RST_IRQHandler

        PUBWEAK WWDG1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
WWDG1_IRQHandler
        B WWDG1_IRQHandler

        PUBWEAK WWDG2_RST_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
WWDG2_RST_IRQHandler
        B WWDG2_RST_IRQHandler

        PUBWEAK TAMP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TAMP_IRQHandler
        B TAMP_IRQHandler

        PUBWEAK RTC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
RTC_IRQHandler
        B RTC_IRQHandler

        PUBWEAK TAMP_S_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TAMP_S_IRQHandler
        B TAMP_S_IRQHandler

        PUBWEAK RTC_S_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
RTC_S_IRQHandler
        B RTC_S_IRQHandler

        PUBWEAK RCC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
RCC_IRQHandler
        B RCC_IRQHandler

        PUBWEAK EXTI2_0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI2_0_IRQHandler
        B EXTI2_0_IRQHandler

        PUBWEAK EXTI2_1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI2_1_IRQHandler
        B EXTI2_1_IRQHandler

        PUBWEAK EXTI2_2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI2_2_IRQHandler
        B EXTI2_2_IRQHandler

        PUBWEAK EXTI2_3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI2_3_IRQHandler
        B EXTI2_3_IRQHandler

        PUBWEAK EXTI2_4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI2_4_IRQHandler
        B EXTI2_4_IRQHandler

        PUBWEAK EXTI2_5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI2_5_IRQHandler
        B EXTI2_5_IRQHandler

        PUBWEAK EXTI2_6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI2_6_IRQHandler
        B EXTI2_6_IRQHandler

        PUBWEAK EXTI2_7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI2_7_IRQHandler
        B EXTI2_7_IRQHandler

