stm32mpu-oem/STM32DDRFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Source/Templates/iar/startup_stm32mp2xx_m33_ns.s
        PUBWEAK EXTI2_8_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI2_8_IRQHandler
        B EXTI2_8_IRQHandler

        PUBWEAK EXTI2_9_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI2_9_IRQHandler
        B EXTI2_9_IRQHandler

        PUBWEAK EXTI2_10_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI2_10_IRQHandler
        B EXTI2_10_IRQHandler

        PUBWEAK EXTI2_11_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI2_11_IRQHandler
        B EXTI2_11_IRQHandler

        PUBWEAK EXTI2_12_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI2_12_IRQHandler
        B EXTI2_12_IRQHandler

        PUBWEAK EXTI2_13_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI2_13_IRQHandler
        B EXTI2_13_IRQHandler

        PUBWEAK EXTI2_14_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI2_14_IRQHandler
        B EXTI2_14_IRQHandler

        PUBWEAK EXTI2_15_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI2_15_IRQHandler
        B EXTI2_15_IRQHandler

        PUBWEAK HPDMA1_Channel0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA1_Channel0_IRQHandler
        B HPDMA1_Channel0_IRQHandler

        PUBWEAK HPDMA1_Channel1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA1_Channel1_IRQHandler
        B HPDMA1_Channel1_IRQHandler

        PUBWEAK HPDMA1_Channel2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA1_Channel2_IRQHandler
        B HPDMA1_Channel2_IRQHandler

        PUBWEAK HPDMA1_Channel3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA1_Channel3_IRQHandler
        B HPDMA1_Channel3_IRQHandler

        PUBWEAK HPDMA1_Channel4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA1_Channel4_IRQHandler
        B HPDMA1_Channel4_IRQHandler

        PUBWEAK HPDMA1_Channel5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA1_Channel5_IRQHandler
        B HPDMA1_Channel5_IRQHandler

        PUBWEAK HPDMA1_Channel6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA1_Channel6_IRQHandler
        B HPDMA1_Channel6_IRQHandler

        PUBWEAK HPDMA1_Channel7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA1_Channel7_IRQHandler
        B HPDMA1_Channel7_IRQHandler

        PUBWEAK HPDMA1_Channel8_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA1_Channel8_IRQHandler
        B HPDMA1_Channel8_IRQHandler

        PUBWEAK HPDMA1_Channel9_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA1_Channel9_IRQHandler
        B HPDMA1_Channel9_IRQHandler

        PUBWEAK HPDMA1_Channel10_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA1_Channel10_IRQHandler
        B HPDMA1_Channel10_IRQHandler

        PUBWEAK HPDMA1_Channel11_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA1_Channel11_IRQHandler
        B HPDMA1_Channel11_IRQHandler

        PUBWEAK HPDMA1_Channel12_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA1_Channel12_IRQHandler
        B HPDMA1_Channel12_IRQHandler

        PUBWEAK HPDMA1_Channel13_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA1_Channel13_IRQHandler
        B HPDMA1_Channel13_IRQHandler

        PUBWEAK HPDMA1_Channel14_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA1_Channel14_IRQHandler
        B HPDMA1_Channel14_IRQHandler

        PUBWEAK HPDMA1_Channel15_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA1_Channel15_IRQHandler
        B HPDMA1_Channel15_IRQHandler

        PUBWEAK HPDMA2_Channel0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA2_Channel0_IRQHandler
        B HPDMA2_Channel0_IRQHandler

        PUBWEAK HPDMA2_Channel1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA2_Channel1_IRQHandler
        B HPDMA2_Channel1_IRQHandler

        PUBWEAK HPDMA2_Channel2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA2_Channel2_IRQHandler
        B HPDMA2_Channel2_IRQHandler

        PUBWEAK HPDMA2_Channel3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA2_Channel3_IRQHandler
        B HPDMA2_Channel3_IRQHandler

        PUBWEAK HPDMA2_Channel4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA2_Channel4_IRQHandler
        B HPDMA2_Channel4_IRQHandler

        PUBWEAK HPDMA2_Channel5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA2_Channel5_IRQHandler
        B HPDMA2_Channel5_IRQHandler

        PUBWEAK HPDMA2_Channel6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA2_Channel6_IRQHandler
        B HPDMA2_Channel6_IRQHandler

        PUBWEAK HPDMA2_Channel7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA2_Channel7_IRQHandler
        B HPDMA2_Channel7_IRQHandler

        PUBWEAK HPDMA2_Channel8_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA2_Channel8_IRQHandler
        B HPDMA2_Channel8_IRQHandler

        PUBWEAK HPDMA2_Channel9_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA2_Channel9_IRQHandler
        B HPDMA2_Channel9_IRQHandler

        PUBWEAK HPDMA2_Channel10_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA2_Channel10_IRQHandler
        B HPDMA2_Channel10_IRQHandler

        PUBWEAK HPDMA2_Channel11_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA2_Channel11_IRQHandler
        B HPDMA2_Channel11_IRQHandler

        PUBWEAK HPDMA2_Channel12_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA2_Channel12_IRQHandler
        B HPDMA2_Channel12_IRQHandler

        PUBWEAK HPDMA2_Channel13_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA2_Channel13_IRQHandler
        B HPDMA2_Channel13_IRQHandler

        PUBWEAK HPDMA2_Channel14_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA2_Channel14_IRQHandler
        B HPDMA2_Channel14_IRQHandler

        PUBWEAK HPDMA2_Channel15_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA2_Channel15_IRQHandler
        B HPDMA2_Channel15_IRQHandler

