stm32mpu-oem/STM32DDRFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Source/Templates/iar/startup_stm32mp2xx_m33_ns.s
        PUBWEAK HPDMA3_Channel0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA3_Channel0_IRQHandler
        B HPDMA3_Channel0_IRQHandler

        PUBWEAK HPDMA3_Channel1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA3_Channel1_IRQHandler
        B HPDMA3_Channel1_IRQHandler

        PUBWEAK HPDMA3_Channel2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA3_Channel2_IRQHandler
        B HPDMA3_Channel2_IRQHandler

        PUBWEAK HPDMA3_Channel3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA3_Channel3_IRQHandler
        B HPDMA3_Channel3_IRQHandler

        PUBWEAK HPDMA3_Channel4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA3_Channel4_IRQHandler
        B HPDMA3_Channel4_IRQHandler

        PUBWEAK HPDMA3_Channel5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA3_Channel5_IRQHandler
        B HPDMA3_Channel5_IRQHandler

        PUBWEAK HPDMA3_Channel6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA3_Channel6_IRQHandler
        B HPDMA3_Channel6_IRQHandler

        PUBWEAK HPDMA3_Channel7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA3_Channel7_IRQHandler
        B HPDMA3_Channel7_IRQHandler

        PUBWEAK HPDMA3_Channel8_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA3_Channel8_IRQHandler
        B HPDMA3_Channel8_IRQHandler

        PUBWEAK HPDMA3_Channel9_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA3_Channel9_IRQHandler
        B HPDMA3_Channel9_IRQHandler

        PUBWEAK HPDMA3_Channel10_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA3_Channel10_IRQHandler
        B HPDMA3_Channel10_IRQHandler

        PUBWEAK HPDMA3_Channel11_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA3_Channel11_IRQHandler
        B HPDMA3_Channel11_IRQHandler

        PUBWEAK HPDMA3_Channel12_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA3_Channel12_IRQHandler
        B HPDMA3_Channel12_IRQHandler

        PUBWEAK HPDMA3_Channel13_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA3_Channel13_IRQHandler
        B HPDMA3_Channel13_IRQHandler

        PUBWEAK HPDMA3_Channel14_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA3_Channel14_IRQHandler
        B HPDMA3_Channel14_IRQHandler

        PUBWEAK HPDMA3_Channel15_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA3_Channel15_IRQHandler
        B HPDMA3_Channel15_IRQHandler

        PUBWEAK LPDMA_Channel0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LPDMA_Channel0_IRQHandler
        B LPDMA_Channel0_IRQHandler

        PUBWEAK LPDMA_Channel1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LPDMA_Channel1_IRQHandler
        B LPDMA_Channel1_IRQHandler

        PUBWEAK LPDMA_Channel2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LPDMA_Channel2_IRQHandler
        B LPDMA_Channel2_IRQHandler

        PUBWEAK LPDMA_Channel3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LPDMA_Channel3_IRQHandler
        B LPDMA_Channel3_IRQHandler

        PUBWEAK ICACHE_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ICACHE_IRQHandler
        B ICACHE_IRQHandler

        PUBWEAK DCACHE_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DCACHE_IRQHandler
        B DCACHE_IRQHandler

        PUBWEAK ADC1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ADC1_IRQHandler
        B ADC1_IRQHandler

        PUBWEAK ADC2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ADC2_IRQHandler
        B ADC2_IRQHandler

        PUBWEAK ADC3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ADC3_IRQHandler
        B ADC3_IRQHandler

        PUBWEAK FDCAN_CAL_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FDCAN_CAL_IRQHandler
        B FDCAN_CAL_IRQHandler

        PUBWEAK FDCAN1_IT0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FDCAN1_IT0_IRQHandler
        B FDCAN1_IT0_IRQHandler

        PUBWEAK FDCAN2_IT0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FDCAN2_IT0_IRQHandler
        B FDCAN2_IT0_IRQHandler

        PUBWEAK FDCAN3_IT0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FDCAN3_IT0_IRQHandler
        B FDCAN3_IT0_IRQHandler

        PUBWEAK FDCAN1_IT1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FDCAN1_IT1_IRQHandler
        B FDCAN1_IT1_IRQHandler

        PUBWEAK FDCAN2_IT1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FDCAN2_IT1_IRQHandler
        B FDCAN2_IT1_IRQHandler

        PUBWEAK FDCAN3_IT1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FDCAN3_IT1_IRQHandler
        B FDCAN3_IT1_IRQHandler

        PUBWEAK TIM1_BRK_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM1_BRK_IRQHandler
        B TIM1_BRK_IRQHandler

        PUBWEAK TIM1_UP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM1_UP_IRQHandler
        B TIM1_UP_IRQHandler

        PUBWEAK TIM1_TRG_COM_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM1_TRG_COM_IRQHandler
        B TIM1_TRG_COM_IRQHandler

        PUBWEAK TIM1_CC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM1_CC_IRQHandler
        B TIM1_CC_IRQHandler

        PUBWEAK TIM20_BRK_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM20_BRK_IRQHandler
        B TIM20_BRK_IRQHandler

        PUBWEAK TIM20_UP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM20_UP_IRQHandler
        B TIM20_UP_IRQHandler

        PUBWEAK TIM20_TRG_COM_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM20_TRG_COM_IRQHandler
        B TIM20_TRG_COM_IRQHandler

        PUBWEAK TIM20_CC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM20_CC_IRQHandler
        B TIM20_CC_IRQHandler

        PUBWEAK TIM2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM2_IRQHandler
        B TIM2_IRQHandler

