stm32mpu-oem/STM32DDRFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Source/Templates/iar/startup_stm32mp2xx_m33_ns.s
        PUBWEAK TIM3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM3_IRQHandler
        B TIM3_IRQHandler

        PUBWEAK TIM4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM4_IRQHandler
        B TIM4_IRQHandler

        PUBWEAK I2C1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C1_IRQHandler
        B I2C1_IRQHandler

        PUBWEAK I3C1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I3C1_IRQHandler
        B I3C1_IRQHandler

        PUBWEAK I2C2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C2_IRQHandler
        B I2C2_IRQHandler

        PUBWEAK I3C2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I3C2_IRQHandler
        B I3C2_IRQHandler

        PUBWEAK SPI1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI1_IRQHandler
        B SPI1_IRQHandler

        PUBWEAK SPI2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI2_IRQHandler
        B SPI2_IRQHandler

        PUBWEAK USART1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USART1_IRQHandler
        B USART1_IRQHandler

        PUBWEAK USART2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USART2_IRQHandler
        B USART2_IRQHandler

        PUBWEAK USART3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USART3_IRQHandler
        B USART3_IRQHandler

        PUBWEAK VDEC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
VDEC_IRQHandler
        B VDEC_IRQHandler

        PUBWEAK TIM8_BRK_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM8_BRK_IRQHandler
        B TIM8_BRK_IRQHandler

        PUBWEAK TIM8_UP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM8_UP_IRQHandler
        B TIM8_UP_IRQHandler

        PUBWEAK TIM8_TRG_COM_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM8_TRG_COM_IRQHandler
        B TIM8_TRG_COM_IRQHandler

        PUBWEAK TIM8_CC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM8_CC_IRQHandler
        B TIM8_CC_IRQHandler

        PUBWEAK FMC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FMC_IRQHandler
        B FMC_IRQHandler

        PUBWEAK SDMMC1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SDMMC1_IRQHandler
        B SDMMC1_IRQHandler

        PUBWEAK TIM5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM5_IRQHandler
        B TIM5_IRQHandler

        PUBWEAK SPI3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI3_IRQHandler
        B SPI3_IRQHandler

        PUBWEAK UART4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
UART4_IRQHandler
        B UART4_IRQHandler

        PUBWEAK UART5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
UART5_IRQHandler
        B UART5_IRQHandler

        PUBWEAK TIM6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM6_IRQHandler
        B TIM6_IRQHandler

        PUBWEAK TIM7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM7_IRQHandler
        B TIM7_IRQHandler

        PUBWEAK ETH1_SBD_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ETH1_SBD_IRQHandler
        B ETH1_SBD_IRQHandler

        PUBWEAK ETH1_PMT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ETH1_PMT_IRQHandler
        B ETH1_PMT_IRQHandler

        PUBWEAK ETH1_LPI_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ETH1_LPI_IRQHandler
        B ETH1_LPI_IRQHandler

        PUBWEAK ETH2_SBD_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ETH2_SBD_IRQHandler
        B ETH2_SBD_IRQHandler

        PUBWEAK ETH2_PMT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ETH2_PMT_IRQHandler
        B ETH2_PMT_IRQHandler

        PUBWEAK ETH2_LPI_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ETH2_LPI_IRQHandler
        B ETH2_LPI_IRQHandler

        PUBWEAK USART6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USART6_IRQHandler
        B USART6_IRQHandler

        PUBWEAK I2C3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C3_IRQHandler
        B I2C3_IRQHandler

        PUBWEAK I3C3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I3C3_IRQHandler
        B I3C3_IRQHandler

        PUBWEAK USBH_EHCI_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USBH_EHCI_IRQHandler
        B USBH_EHCI_IRQHandler

        PUBWEAK USBH_OHCI_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USBH_OHCI_IRQHandler
        B USBH_OHCI_IRQHandler

        PUBWEAK DCMI_PSSI_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DCMI_PSSI_IRQHandler
        B DCMI_PSSI_IRQHandler

        PUBWEAK CSI_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CSI_IRQHandler
        B CSI_IRQHandler

        PUBWEAK DSI_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DSI_IRQHandler
        B DSI_IRQHandler

        PUBWEAK CRYP1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CRYP1_IRQHandler
        B CRYP1_IRQHandler

        PUBWEAK HASH_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HASH_IRQHandler
        B HASH_IRQHandler

        PUBWEAK PKA_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
PKA_IRQHandler
        B PKA_IRQHandler

        PUBWEAK FPU_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
FPU_IRQHandler
        B FPU_IRQHandler

        PUBWEAK UART7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
UART7_IRQHandler
        B UART7_IRQHandler

        PUBWEAK UART8_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
UART8_IRQHandler
        B UART8_IRQHandler

        PUBWEAK UART9_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
UART9_IRQHandler
        B UART9_IRQHandler

        PUBWEAK LPUART1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LPUART1_IRQHandler
        B LPUART1_IRQHandler

        PUBWEAK SPI4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI4_IRQHandler
        B SPI4_IRQHandler

