stm32mpu-oem/STM32DDRFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Source/Templates/iar/startup_stm32mp2xx_m33_ns.s
        PUBWEAK SPI5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI5_IRQHandler
        B SPI5_IRQHandler

        PUBWEAK SPI6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI6_IRQHandler
        B SPI6_IRQHandler

        PUBWEAK SPI7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI7_IRQHandler
        B SPI7_IRQHandler

        PUBWEAK SPI8_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPI8_IRQHandler
        B SPI8_IRQHandler

        PUBWEAK SAI1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SAI1_IRQHandler
        B SAI1_IRQHandler

        PUBWEAK LTDC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LTDC_IRQHandler
        B LTDC_IRQHandler

        PUBWEAK LTDC_ER_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LTDC_ER_IRQHandler
        B LTDC_ER_IRQHandler

        PUBWEAK LTDC_SEC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LTDC_SEC_IRQHandler
        B LTDC_SEC_IRQHandler

        PUBWEAK LTDC_SEC_ER_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LTDC_SEC_ER_IRQHandler
        B LTDC_SEC_ER_IRQHandler

        PUBWEAK SAI2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SAI2_IRQHandler
        B SAI2_IRQHandler

        PUBWEAK OCTOSPI1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
OCTOSPI1_IRQHandler
        B OCTOSPI1_IRQHandler

        PUBWEAK OCTOSPI2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
OCTOSPI2_IRQHandler
        B OCTOSPI2_IRQHandler

        PUBWEAK OTFDEC1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
OTFDEC1_IRQHandler
        B OTFDEC1_IRQHandler

        PUBWEAK LPTIM1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LPTIM1_IRQHandler
        B LPTIM1_IRQHandler

        PUBWEAK VENC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
VENC_IRQHandler
        B VENC_IRQHandler

        PUBWEAK I2C4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C4_IRQHandler
        B I2C4_IRQHandler

        PUBWEAK USBH_WAKEUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USBH_WAKEUP_IRQHandler
        B USBH_WAKEUP_IRQHandler

        PUBWEAK SPDIFRX_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SPDIFRX_IRQHandler
        B SPDIFRX_IRQHandler

        PUBWEAK IPCC1_RX_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
IPCC1_RX_IRQHandler
        B IPCC1_RX_IRQHandler

        PUBWEAK IPCC1_TX_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
IPCC1_TX_IRQHandler
        B IPCC1_TX_IRQHandler

        PUBWEAK IPCC1_RX_S_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
IPCC1_RX_S_IRQHandler
        B IPCC1_RX_S_IRQHandler

        PUBWEAK IPCC1_TX_S_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
IPCC1_TX_S_IRQHandler
        B IPCC1_TX_S_IRQHandler

        PUBWEAK IPCC2_RX_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
IPCC2_RX_IRQHandler
        B IPCC2_RX_IRQHandler

        PUBWEAK IPCC2_TX_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
IPCC2_TX_IRQHandler
        B IPCC2_TX_IRQHandler

        PUBWEAK IPCC2_RX_S_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
IPCC2_RX_S_IRQHandler
        B IPCC2_RX_S_IRQHandler

        PUBWEAK IPCC2_TX_S_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
IPCC2_TX_S_IRQHandler
        B IPCC2_TX_S_IRQHandler

        PUBWEAK SAES_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SAES_IRQHandler
        B SAES_IRQHandler

        PUBWEAK CRYP2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CRYP2_IRQHandler
        B CRYP2_IRQHandler

        PUBWEAK I2C5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C5_IRQHandler
        B I2C5_IRQHandler

        PUBWEAK USB3DR_WAKEUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USB3DR_WAKEUP_IRQHandler
        B USB3DR_WAKEUP_IRQHandler

        PUBWEAK GPU_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
GPU_IRQHandler
        B GPU_IRQHandler

        PUBWEAK MDF1_FLT0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
MDF1_FLT0_IRQHandler
        B MDF1_FLT0_IRQHandler

        PUBWEAK MDF1_FLT1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
MDF1_FLT1_IRQHandler
        B MDF1_FLT1_IRQHandler

        PUBWEAK MDF1_FLT2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
MDF1_FLT2_IRQHandler
        B MDF1_FLT2_IRQHandler

        PUBWEAK MDF1_FLT3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
MDF1_FLT3_IRQHandler
        B MDF1_FLT3_IRQHandler

        PUBWEAK MDF1_FLT4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
MDF1_FLT4_IRQHandler
        B MDF1_FLT4_IRQHandler

        PUBWEAK MDF1_FLT5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
MDF1_FLT5_IRQHandler
        B MDF1_FLT5_IRQHandler

        PUBWEAK MDF1_FLT6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
MDF1_FLT6_IRQHandler
        B MDF1_FLT6_IRQHandler

        PUBWEAK MDF1_FLT7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
MDF1_FLT7_IRQHandler
        B MDF1_FLT7_IRQHandler

        PUBWEAK SAI3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SAI3_IRQHandler
        B SAI3_IRQHandler

        PUBWEAK TIM15_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM15_IRQHandler
        B TIM15_IRQHandler

        PUBWEAK TIM16_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM16_IRQHandler
        B TIM16_IRQHandler

        PUBWEAK TIM17_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM17_IRQHandler
        B TIM17_IRQHandler

        PUBWEAK TIM12_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM12_IRQHandler
        B TIM12_IRQHandler

        PUBWEAK SDMMC2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SDMMC2_IRQHandler
        B SDMMC2_IRQHandler

        PUBWEAK DCMIPP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DCMIPP_IRQHandler
        B DCMIPP_IRQHandler

        PUBWEAK HSEM_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HSEM_IRQHandler
        B HSEM_IRQHandler

