stm32mpu-oem/STM32DDRFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Source/Templates/iar/startup_stm32mp2xx_m33_ns.s
        PUBWEAK HSEM_S_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HSEM_S_IRQHandler
        B HSEM_S_IRQHandler

        PUBWEAK nCTIIRQ1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
nCTIIRQ1_IRQHandler
        B nCTIIRQ1_IRQHandler

        PUBWEAK nCTIIRQ2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
nCTIIRQ2_IRQHandler
        B nCTIIRQ2_IRQHandler

        PUBWEAK TIM13_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM13_IRQHandler
        B TIM13_IRQHandler

        PUBWEAK TIM14_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM14_IRQHandler
        B TIM14_IRQHandler

        PUBWEAK TIM10_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM10_IRQHandler
        B TIM10_IRQHandler

        PUBWEAK RNG_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
RNG_IRQHandler
        B RNG_IRQHandler

        PUBWEAK ADF1_FLT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ADF1_FLT_IRQHandler
        B ADF1_FLT_IRQHandler

        PUBWEAK I2C6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C6_IRQHandler
        B I2C6_IRQHandler

        PUBWEAK COMBOPHY_WAKEUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
COMBOPHY_WAKEUP_IRQHandler
        B COMBOPHY_WAKEUP_IRQHandler

        PUBWEAK I2C7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C7_IRQHandler
        B I2C7_IRQHandler

        PUBWEAK I2C8_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C8_IRQHandler
        B I2C8_IRQHandler

        PUBWEAK I3C4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I3C4_IRQHandler
        B I3C4_IRQHandler

        PUBWEAK SDMMC3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SDMMC3_IRQHandler
        B SDMMC3_IRQHandler

        PUBWEAK LPTIM2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LPTIM2_IRQHandler
        B LPTIM2_IRQHandler

        PUBWEAK LPTIM3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LPTIM3_IRQHandler
        B LPTIM3_IRQHandler

        PUBWEAK LPTIM4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LPTIM4_IRQHandler
        B LPTIM4_IRQHandler

        PUBWEAK LPTIM5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LPTIM5_IRQHandler
        B LPTIM5_IRQHandler

        PUBWEAK OTFDEC2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
OTFDEC2_IRQHandler
        B OTFDEC2_IRQHandler

        PUBWEAK CPU1_SEV_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CPU1_SEV_IRQHandler
        B CPU1_SEV_IRQHandler

        PUBWEAK CPU3_SEV_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CPU3_SEV_IRQHandler
        B CPU3_SEV_IRQHandler

        PUBWEAK RCC_WAKEUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
RCC_WAKEUP_IRQHandler
        B RCC_WAKEUP_IRQHandler

        PUBWEAK SAI4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SAI4_IRQHandler
        B SAI4_IRQHandler

        PUBWEAK DTS_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DTS_IRQHandler
        B DTS_IRQHandler

        PUBWEAK TIM11_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIM11_IRQHandler
        B TIM11_IRQHandler

        PUBWEAK CPU2_WAKEUP_PIN_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CPU2_WAKEUP_PIN_IRQHandler
        B CPU2_WAKEUP_PIN_IRQHandler

        PUBWEAK USB3DR_BC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USB3DR_BC_IRQHandler
        B USB3DR_BC_IRQHandler

        PUBWEAK USB3DR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USB3DR_IRQHandler
        B USB3DR_IRQHandler

        PUBWEAK UCPD1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
UCPD1_IRQHandler
        B UCPD1_IRQHandler

        PUBWEAK SERF_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
SERF_IRQHandler
        B SERF_IRQHandler

        PUBWEAK BUSPERFM_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
BUSPERFM_IRQHandler
        B BUSPERFM_IRQHandler

        PUBWEAK RAMCFG_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
RAMCFG_IRQHandler
        B RAMCFG_IRQHandler

        PUBWEAK DDRCTRL_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DDRCTRL_IRQHandler
        B DDRCTRL_IRQHandler

        PUBWEAK DDRPHYC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DDRPHYC_IRQHandler
        B DDRPHYC_IRQHandler

        PUBWEAK DFI_ERR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DFI_ERR_IRQHandler
        B DFI_ERR_IRQHandler

        PUBWEAK IAC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
IAC_IRQHandler
        B IAC_IRQHandler

        PUBWEAK VDDCPU_VD_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
VDDCPU_VD_IRQHandler
        B VDDCPU_VD_IRQHandler

        PUBWEAK VDDCORE_VD_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
VDDCORE_VD_IRQHandler
        B VDDCORE_VD_IRQHandler

        PUBWEAK ETHSW_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ETHSW_IRQHandler
        B ETHSW_IRQHandler

        PUBWEAK ETHSW_MSGBUF_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ETHSW_MSGBUF_IRQHandler
        B ETHSW_MSGBUF_IRQHandler

        PUBWEAK ETHSW_FSC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ETHSW_FSC_IRQHandler
        B ETHSW_FSC_IRQHandler

        PUBWEAK HPDMA1_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA1_WKUP_IRQHandler
        B HPDMA1_WKUP_IRQHandler

        PUBWEAK HPDMA2_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA2_WKUP_IRQHandler
        B HPDMA2_WKUP_IRQHandler

        PUBWEAK HPDMA3_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
HPDMA3_WKUP_IRQHandler
        B HPDMA3_WKUP_IRQHandler

        PUBWEAK LPDMA_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LPDMA_WKUP_IRQHandler
        B LPDMA_WKUP_IRQHandler

        PUBWEAK UCPD1_VBUS_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
UCPD1_VBUS_IRQHandler
        B UCPD1_VBUS_IRQHandler

        PUBWEAK UCPD1_VSAFE5V_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
UCPD1_VSAFE5V_IRQHandler
        B UCPD1_VSAFE5V_IRQHandler

        PUBWEAK RCC_HSI_FMON_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
RCC_HSI_FMON_IRQHandler
        B RCC_HSI_FMON_IRQHandler

        PUBWEAK VDDGPU_VD_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
VDDGPU_VD_IRQHandler
        B VDDGPU_VD_IRQHandler

        PUBWEAK EXTI1_0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI1_0_IRQHandler
        B EXTI1_0_IRQHandler

        PUBWEAK EXTI1_1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI1_1_IRQHandler
        B EXTI1_1_IRQHandler

        PUBWEAK EXTI1_2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI1_2_IRQHandler
        B EXTI1_2_IRQHandler

        PUBWEAK EXTI1_3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI1_3_IRQHandler
        B EXTI1_3_IRQHandler

        PUBWEAK EXTI1_4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI1_4_IRQHandler
        B EXTI1_4_IRQHandler

        PUBWEAK EXTI1_5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI1_5_IRQHandler
        B EXTI1_5_IRQHandler

        PUBWEAK EXTI1_6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI1_6_IRQHandler
        B EXTI1_6_IRQHandler

        PUBWEAK EXTI1_7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI1_7_IRQHandler
        B EXTI1_7_IRQHandler

        PUBWEAK EXTI1_8_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI1_8_IRQHandler
        B EXTI1_8_IRQHandler

        PUBWEAK EXTI1_9_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI1_9_IRQHandler
        B EXTI1_9_IRQHandler

        PUBWEAK EXTI1_10_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI1_10_IRQHandler
        B EXTI1_10_IRQHandler

        PUBWEAK EXTI1_11_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI1_11_IRQHandler
        B EXTI1_11_IRQHandler

        PUBWEAK EXTI1_12_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI1_12_IRQHandler
        B EXTI1_12_IRQHandler

        PUBWEAK EXTI1_13_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI1_13_IRQHandler
        B EXTI1_13_IRQHandler

        PUBWEAK EXTI1_14_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI1_14_IRQHandler
        B EXTI1_14_IRQHandler

        PUBWEAK EXTI1_15_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EXTI1_15_IRQHandler
        B EXTI1_15_IRQHandler

        PUBWEAK IS2M_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
IS2M_IRQHandler
        B IS2M_IRQHandler

        PUBWEAK DDRPERFM_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DDRPERFM_IRQHandler
        B DDRPERFM_IRQHandler

        END
